Repository: shelllet/languages
Catalog: Strings/*/Resources3.resw
Source language: en_us
Languages: ja_jp, zh_hans_cn, zh_tw

# Mouse.Description
source: Mouse action
ja_jp: マウスアクション
zh_hans_cn: 鼠标动作
zh_tw: 滑鼠動作

# Mouse.Title
source: Mouse
ja_jp: マウス
zh_hans_cn: 鼠标
zh_tw: 滑鼠

# MovePointer.Description
source: Move Pointer
ja_jp: マウスを動かす
zh_hans_cn: 模拟鼠标移动
zh_tw: 移動滑鼠

# MovePointer.Title
source: MovePointer
zh_hans_cn: 鼠标移动
zh_tw: 模擬滑鼠移動

# Click.Description
source: Simulate the mouse click
ja_jp: マウスクリックの動作をシミュレートする
zh_hans_cn: 模拟鼠标点击
zh_tw: 模擬滑鼠點擊

# Click.Title
source: Click
ja_jp: クリック
zh_hans_cn: 点击
zh_tw: 點擊

# MoveClick.Description
source: Move the mouse and click the corresponding button of the mouse after reaching the position
ja_jp: マウスを動かし、位置に達したらマウスの対応するキーをクリックします
zh_hans_cn: 移动鼠标，到达位置后点击鼠标相应的键
zh_tw: 移動滑鼠，到達位置後點擊滑鼠相應的鍵

# MoveClick.Title
source: MoveClick
zh_hans_cn: 移动并点击
zh_tw: 移動並點擊

# DoubleClick.Description
source: Simulate the mouse-double-click action
ja_jp: マウスのダブルクリックアクションをシミュレートする
zh_hans_cn: 模拟鼠标双击动作
zh_tw: 類比滑鼠按兩下動作

# DoubleClick.Title
source: DoubleClick
zh_hans_cn: 双击
zh_tw: 按兩下

# RightClick.Description
source: Simulate right mouse click
ja_jp: マウスの右クリックをシミュレート
zh_hans_cn: 模拟鼠标右键点击
zh_tw: 類比滑鼠右鍵點擊

# RightClick.Title
source: RightClick
zh_hans_cn: 右键点击
zh_tw: 右鍵點擊

# DragPointer.Description
source: Simulate the mouse drag operation, that is, press the left mouse button at the current position of the mouse, drag the mouse to the target position, and then release the left mouse button.
zh_hans_cn: 模拟鼠标拖动操作，即在鼠标的当前位置按下鼠标左键，拖动鼠标到目标位置，然后释放鼠标左键。
zh_tw: 模擬鼠標拖動操作，即在鼠標的當前位置按下鼠標左鍵，拖動鼠標到目標位置，然後釋放鼠標左鍵。

# DragPointer.Title
source: Drag
ja_jp: ドラッグ
zh_hans_cn: 拖动
zh_tw: 拖動

# ListenMouse.Description
source: Listen to the mouse
ja_jp: マウスのリスニング
zh_hans_cn: 监听鼠标
zh_tw: 監聽滑鼠

# ListenMouse.Title
source: ListenMouse
zh_hans_cn: 监听鼠标
zh_tw: 監聽滑鼠

# System.Description
source: System
ja_jp: システム
zh_hans_cn: 系统
zh_tw: 系統

# System.Title
source: System
ja_jp: システム
zh_hans_cn: 系统
zh_tw: 系統

# Async.Description
source: A series of actions that support asynchronous operations, such as timer, thread
ja_jp: タイマー、スレッドなどの非同期操作をサポートする一連のアクション
zh_hans_cn: 支持异步操作的一系列动作，比如定时器，线程
zh_tw: 支持異步操作的一系列動作，比如定時器，線程

# Async.Title
source: Async
ja_jp: 非同期操作
zh_hans_cn: 异步操作
zh_tw: 異步操作

# Wait.Description
source: Waiting, also can be called dormancy. it stops the action for a while before running.
ja_jp: 待機は、休眠とも呼ばれる。アクションをしばらく停止させてから、実行を続行します。
zh_hans_cn: 等待，又可以称为休眠。它可以让动作停止一段时间再继续运行。
zh_tw: 等待，又可以稱為休眠。 它可以讓動作停止一段時間再繼續運行。

# Wait.Title
source: Wait
ja_jp: 待つ
zh_hans_cn: 等待
zh_tw: 等待

# FileQuery.Description
source: Search for files
ja_jp: ファイルの検索
zh_hans_cn: 搜索文件
zh_tw: 蒐索檔案

# FileQuery.Title
source: FileQuery
ja_jp: ファイルの検索
zh_hans_cn: 搜索文件
zh_tw: 蒐索檔案

# StartProcess.Description
source: Start the application and wait for the end
ja_jp: アプリケーションを開始し、終了を待ちます
zh_hans_cn: 启动应用程序，并等待结束
zh_tw: 啟動應用程序，並等待結束

# StartProcess.Title
source: StartProcess
ja_jp: アプリケーションを開始します
zh_hans_cn: 启动应用程序
zh_tw: 啟動應用程序

# CaptureWindow.Description
source: This action is used to take screenshots of the specified window
zh_hans_cn: 此动作用来对指定的窗口进行截图
zh_tw: 此動作用來對指定的視窗進行截圖

# CaptureWindow.Title
source: CaptureWindow
zh_hans_cn: 窗口截图
zh_tw: 視窗截圖

# CropImage.Description
source: This action can be selected on a picture of an area, to be cut.
ja_jp: 画像上の領域を選択してトリミングします。
zh_hans_cn: 该动作可以在一张图片上选择一块区域，进行裁切。
zh_tw: 該動作可以在一張圖片上選擇一塊區域，進行裁切。

# CropImage.Title
source: CropImage
zh_hans_cn: 裁切图片
zh_tw: 裁切圖片

# PlayRecord.Description
source: Play the recorded keyboard and mouse macro.
ja_jp: 録音したキーボードマクロとマウスマクロを再生します。
zh_hans_cn: 播放录制的键盘和鼠标宏。
zh_tw: 重放錄製的鍵盤和滑鼠宏。

# PlayRecord.Title
source: PlayRecord
zh_hans_cn: 键盘/鼠标宏重放
zh_tw: 鍵盤/鼠標宏重放

# WorkTimer.Description
source: The subprocess can be repeated at certain time intervals.
ja_jp: サブフローは一定の時間間隔で繰り返し実行することができる。
zh_hans_cn: 可以按照一定的时间间隔，重复执行子流程。
zh_tw: 可以按照一定的時間間隔，重複執行子流程。

# WorkTimer.Title
source: Timer
ja_jp: タイマー
zh_hans_cn: 定时器
zh_tw: 計时器

# ImageClassification.Description
source: A suggested model of onnx trained using the * yolo5 * network. other network models that may need to customize the output through a script.
zh_hans_cn: 建议使用 *Yolo5 *网络训练的 ONNX 的模型。其它网络模型，可能需要通过脚本自定义输出。
zh_tw: 建議使用*yolo5 *網絡訓練的onnx的模型。 其它網絡模型，可能需要通過腳本自定義輸出。

# ImageClassification.Title
source: ImageClassification
zh_hans_cn: 目标分类
zh_tw: 目標分類

# Type.Description
source: Type
ja_jp: タイプ
zh_hans_cn: 类型
zh_tw: 類型

# Type.Title
source: Type
ja_jp: タイプ
zh_hans_cn: 类型
zh_tw: 類型

# TypeUri.Description
source: Create a web address type
ja_jp: Webアドレスの種類を作成します
zh_hans_cn: 创建一个 网址 类型
zh_tw: 創建一個網址類型

# TypeUri.Title
source: Url
ja_jp: ウェブアドレス
zh_hans_cn: 网址
zh_tw: 網址

# TypePassword.Description
source: Define the password, the string type
ja_jp: パスワードの定義、文字列型
zh_hans_cn: 定义 密码，字符串类型
zh_tw: 定義密碼，字串類型

# TypePassword.Title
source: Password
ja_jp: パスワード
zh_hans_cn: 密码
zh_tw: 密碼

# TypePoint.Description
source: Define a coordinate type
ja_jp: 座標タイプを定義するには
zh_hans_cn: 定义一个 坐标 类型
zh_tw: 定義一個座標類型

# TypePoint.Title
source: Coordinate
ja_jp: 座標
zh_hans_cn: 坐标
zh_tw: 座標

# TypeFile.Description
source: Define the file type
ja_jp: ファイルタイプの定義
zh_hans_cn: 定义 文件 类型
zh_tw: 定義檔案類型

# TypeFile.Title
source: Document
ja_jp: ファイル
zh_hans_cn: 文件
zh_tw: 文件

# TypeFolder.Description
source: Defines the folder type
ja_jp: フォルダタイプの定義
zh_hans_cn: 定义 文件夹 类型
zh_tw: 定義資料夾類型

# TypeFolder.Title
source: File
ja_jp: フォルダ
zh_hans_cn: 文件夹
zh_tw: 資料夾

# ClipboardValue.Description
source: Gets the current content of the clipboard
ja_jp: クリップボードの現在の内容を取得
zh_hans_cn: 获取 剪切板 当前的内容
zh_tw: 獲取剪切板當前的內容

# ClipboardValue.Title
source: Shear plate
ja_jp: せん断板
zh_hans_cn: 剪切板
zh_tw: 剪切板

# TypeShortcut.Description
source: Defines a shortcut key type
ja_jp: ショートカットキーの種類の定義
zh_hans_cn: 定义一个 快捷键 类型
zh_tw: 定義一個快速鍵類型

# TypeShortcut.Title
source: Keyboard shortcuts
ja_jp: ショートカットキー
zh_hans_cn: 快捷键
zh_tw: 快速鍵

# Window.Description
source: Window
zh_hans_cn: 窗口
zh_tw: 視窗

# Window.Title
source: Window
zh_hans_cn: 窗口
zh_tw: 視窗

# FindWindow.Description
source: Find a window in the windows system, which through the window title or window class.
ja_jp: Windowsシステムでウィンドウを検索します。ウィンドウタイトルまたはウィンドウクラスでウィンドウを検索します。
zh_hans_cn: 查找 Windows 系统中的窗口，该动作通过窗口标题或者窗口类搜索窗口。
zh_tw: 查找windows系統中的視窗，該動作通過視窗標題或者視窗類蒐索視窗。

# FindWindow.Title
source: Find the window
ja_jp: 「検索」ウィンドウ
zh_hans_cn: 查找窗口
zh_tw: 查找視窗

# Control.Description
source: Logic
ja_jp: ろんり
zh_hans_cn: 逻辑
zh_tw: 邏輯

# Control.Title
source: Logic
ja_jp: ろんり
zh_hans_cn: 逻辑
zh_tw: 邏輯

# For.Description
source: Iterate through the elements of the range
zh_hans_cn: 用来迭代相应的列表数据，遍历列表的每一个元素，也可称为*循环*。
zh_tw: 用來迭代相應的列表數據，遍歷列表的每一個元素，也可稱為*循環*。

# For.Title
source: For
zh_hans_cn: 循环
zh_tw: 循环

# If.Description
source: Conditional judgment, equivalent to the if statement in python, the action has two branches, if the condition holds, execute the process branch on the left, otherwise, execute the process branch on the right
ja_jp: 条件判定は、python中のif文に相当し、この動作には2つの分岐があり、条件が成立すれば左のフロー分岐を、そうでなければ右のフロー分岐を実行する
zh_hans_cn: 条件判断，相当于python 中的 if语句，该动作有两条分支，如果条件成立，执行左边的流程分支，否则，执行右边的流程分支
zh_tw: 條件判斷，相當於python中的if語句，該動作有兩條分支，如果條件成立，執行左邊的流程分支，否則，執行右邊的流程分支

# If.Title
source: Judge
ja_jp: 判断
zh_hans_cn: 判断
zh_tw: 判斷

# Invoke.Description
source: This action can invoke other processes (non-sub-processes).
ja_jp: このアクションは、サブプロセス以外の他のプロセスを呼び出すことができます。
zh_hans_cn: 此动作可以调用其他流程（非子流程）。
zh_tw: 此動作可以調用其他流程（非子流程）。

# Invoke.Title
source: Transfer temporarily for a specific task
ja_jp: 呼び出す
zh_hans_cn: 调用
zh_tw: 調用

# Break.Description
source: Stop cycling, mainly used in subprocesses, such as cycle actions
ja_jp: ループを停止することは、主にループ動作のようなサブプロセスで用いられる
zh_hans_cn: 停止循环，主要用在子流程当中，比如 循环 动作中
zh_tw: 停止迴圈，主要用在子流程當中，比如迴圈動作中

# Break.Title
source: Stop the cycle
ja_jp: サイクルの停止
zh_hans_cn: 停止循环
zh_tw: 停止迴圈

# OpenUri.Description
source: This action can start the browser to open the specified url
ja_jp: ブラウザを起動して指定したwebアドレスを開きます
zh_hans_cn: 该动作可以启动浏览器打开指定的网址
zh_tw: 該動作可以啟動瀏覽器打開指定的網址

# OpenUri.Title
source: Open the link
ja_jp: リンクを開く
zh_hans_cn: 打开链接
zh_tw: 打開連結

# Code.Description
source: This action can execute a python script.
ja_jp: このアクションはpythonスクリプトを実行します。
zh_hans_cn: 该动作可以执行Python脚本。
zh_tw: 該動作可以執行python腳本。

# Code.Title
source: Script
ja_jp: スクリプト
zh_hans_cn: 脚本
zh_tw: 腳本

# Media.Description
source: Media, including screenshots, sound playback and other actions
ja_jp: スクリーンショット、音声再生などのメディア
zh_hans_cn: 媒体,包括截图、声音播放等动作
zh_tw: 媒體，包括截圖、聲音播放等動作

# Media.Title
source: Medium
ja_jp: メディア
zh_hans_cn: 媒体
zh_tw: 媒體

# MediaPlay.Description
source: Play sound files
ja_jp: サウンドファイルを再生
zh_hans_cn: 播放声音文件
zh_tw: 播放聲音檔案

# MediaPlay.Title
source: Sound play
ja_jp: サウンド再生
zh_hans_cn: 声音播放
zh_tw: 聲音播放

# Keyboard.Description
source: Fingerboard
ja_jp: キーボード
zh_hans_cn: 键盘
zh_tw: 鍵盤

# Keyboard.Title
source: Fingerboard
ja_jp: キーボード
zh_hans_cn: 键盘
zh_tw: 鍵盤

# SendKey.Description
source: Send the button
ja_jp: 送信キー
zh_hans_cn: 发送按键
zh_tw: 發送按鍵

# SendKey.Title
source: Send the button
ja_jp: 送信キー
zh_hans_cn: 发送按键
zh_tw: 發送按鍵

# SendText.Description
source: Send text
ja_jp: テキストの送信
zh_hans_cn: 发送文本
zh_tw: 發送文字

# SendText.Title
source: Send text
ja_jp: テキストの送信
zh_hans_cn: 发送文本
zh_tw: 發送文字

# PressKey.Description
source: Press the button will not release the key
ja_jp: キーを押したまま、キーを放さない
zh_hans_cn: 按下按键，不会释放按键
zh_tw: 按下按鍵，不會釋放按鍵

# PressKey.Title
source: Press the button
ja_jp: キーを押す
zh_hans_cn: 按下按键
zh_tw: 按下按鍵

# ReleaseKey.Description
source: Release the pressed keyboard key
ja_jp: キーを放します
zh_hans_cn: 释放按下的键盘按键
zh_tw: 釋放按下的鍵盤按鍵

# ReleaseKey.Title
source: Release the button
ja_jp: キーを離す
zh_hans_cn: 释放按键
zh_tw: 釋放按鍵

# ListenKeyboard.Description
source: Listen to the keyboard
ja_jp: リスニングキーボード
zh_hans_cn: 监听键盘
zh_tw: 監聽鍵盤

# ListenKeyboard.Title
source: Listen to the keyboard
ja_jp: リスニングキーボード
zh_hans_cn: 监听键盘
zh_tw: 監聽鍵盤

# Image.Description
source: Image processing
ja_jp: 画像処理
zh_hans_cn: 图像处理
zh_tw: 圖像處理

# Image.Title
source: Image
zh_hans_cn: 图像处理
zh_tw: 圖像處理

# ImageSave.Description
source: Save the image type in the process to the local disk.
ja_jp: プロセス中の画像タイプをローカルディスクに保存します。
zh_hans_cn: 把流程当中的图片类型保存到本地磁盘上面。
zh_tw: 把流程當中的圖片類型保存到本地磁片上面。

# ImageSave.Title
source: ImageSave
zh_hans_cn: 保存图片
zh_tw: 保存圖片

# FeatureDetect.Description
source: This action finds a template image in a image through feature matching.
zh_hans_cn: 该动作通过特征匹配，在一张图像当中查找模板图像。
zh_tw: 該動作通過特徵匹配，在一張圖像當中查找模板圖像。

# FeatureDetect.Title
source: FeatureDetect
zh_hans_cn: 特征匹配
zh_tw: 特徵匹配

# ExitApp.Description
source: Exit process execution
ja_jp: プロセス実行の終了
zh_hans_cn: 退出流程执行
zh_tw: 退出流程執行

# ExitApp.Title
source: ExitApp
zh_hans_cn: 结束流程
zh_tw: 結束流程

# ImageLoad.Description
source: Load the images from the local disk
ja_jp: ローカルディスクから画像をロードします
zh_hans_cn: 从本地磁盘加载图像
zh_tw: 從本地磁片加載影像

# ImageLoad.Title
source: Load the image
ja_jp: 画像の読み込み
zh_hans_cn: 加载图像
zh_tw: 加載影像

# ObjectDetection.Description
source: Only support onnx models in yolo v5 format, other onnx detection models need to be output through scripts
zh_hans_cn: 仅支持 Yolo5格式的 ONNX 模型，其它 ONNX 检测模型需要通过脚本自已解析输出
zh_tw: 僅支持yolo5格式的onnx模型，其它onnx檢測模型需要通過腳本自已解析輸出

# ObjectDetection.Title
source: ObjectDetection
zh_hans_cn: 对象检测
zh_tw: 对象檢測

# PointConvert.Description
source: Window coordinates to screen coordinates, or screen coordinates to window coordinates
ja_jp: ウィンドウ座標からスクリーン座標へ、またはスクリーン座標からウィンドウ座標へ
zh_hans_cn: 窗口坐标转屏幕坐标，或者屏幕坐标转窗口坐标
zh_tw: 視窗座標轉荧幕座標，或者荧幕座標轉視窗座標

# PointConvert.Title
source: Coordinate transformation
ja_jp: 座標変換
zh_hans_cn: 坐标转换
zh_tw: 座標轉換

# WorkExit.Description
source: Can be used to end the thread action being performed.
zh_hans_cn: 可用于结束正在执行的 线程 动作。
zh_tw: 可用於結束正在執行的線程動作。

# WorkExit.Title
source: WorkExit
zh_hans_cn: 异步停止
zh_tw: 異步停止

# AdbPackages.Description
source: This action gets all the installation packages in the android emulator.
ja_jp: このアクションは、androidエミュレータ内のすべてのインストールパッケージを取得します。
zh_hans_cn: 此动作可以获取安卓模拟器当中的所有安装包。
zh_tw: 此動作可以獲取安卓模擬器當中的所有安裝包。

# AdbPackages.Title
source: Installation package
ja_jp: パッケージのインストール
zh_hans_cn: 应用列表
zh_tw: 應用列表

# Filesystem.Description
source: Document
ja_jp: ファイル
zh_hans_cn: 文件
zh_tw: 文件

# Filesystem.Title
source: Document
ja_jp: ファイル
zh_hans_cn: 文件
zh_tw: 文件

# FileRead.Description
source: Read the file
ja_jp: ファイルの読み込み
zh_hans_cn: 读取文件
zh_tw: 讀取檔案

# FileRead.Title
source: Read the file
ja_jp: ファイルの読み込み
zh_hans_cn: 读取文件
zh_tw: 讀取檔案

# FileWrite.Description
source: File writing
ja_jp: ファイル書き込み
zh_hans_cn: 文件写入
zh_tw: 檔案寫入

# FileWrite.Title
source: File writing
ja_jp: ファイル書き込み
zh_hans_cn: 文件写入
zh_tw: 檔案寫入

# Detection.Description
source: Image detection
ja_jp: がぞうけんしゅつ
zh_hans_cn: 图像检测
zh_tw: 影像檢測

# Detection.Title
source: Detection
zh_hans_cn: 图像检测
zh_tw: 影像檢測

# Dnn.Description
source: Deep learning
ja_jp: ディープラーニング
zh_hans_cn: 深度学习
zh_tw: 深度學習

# Dnn.Title
source: DNN
zh_hans_cn: 深度学习
zh_tw: 深度學習

# Draw.Description
source: Draw
zh_hans_cn: 绘图
zh_tw: 繪圖

# Draw.Title
source: Draw
zh_hans_cn: 绘图
zh_tw: 繪圖

# TypeResource.Description
source: Define the resource type
ja_jp: リソース・タイプの定義
zh_hans_cn: 定义 资源 类型
zh_tw: 定義資源類型

# TypeResource.Title
source: Resource
ja_jp: リソース
zh_hans_cn: 资源
zh_tw: 資源

# MatchShapes.Description
source: Finding shapes from the image, even if the shape rotation does not have much impact on the match.
ja_jp: イメージからシェイプを検索すると、シェイプが回転しても、一致にはあまり影響しません。
zh_hans_cn: 从图像上查找形状,即使形状旋转也不会对匹配产生太大影响。
zh_tw: 從影像上查找形狀，即使形狀旋轉也不會對匹配產生太大影響。

# MatchShapes.Title
source: MatchShapes
zh_hans_cn: 形状匹配
zh_tw: 形狀匹配

# IndexLoc.Description
source: Index-based to select rows and/or columns in pandas
zh_hans_cn: 基于索引来选择 Pandas 中的行和列。
zh_tw: 基於索引來選擇 Pandas 中的行和列。

# IndexLoc.Title
source: IndexLoc
zh_hans_cn: 行列选择（索引）
zh_tw: 行列選擇（索引）

# RandomNumber.Description
source: Generate random numbers
ja_jp: 乱数の生成
zh_hans_cn: 生成随机数
zh_tw: 生成亂數

# RandomNumber.Title
source: RandomNumber
zh_hans_cn: 随机数
zh_tw: 亂數

# Database.Description
source: Data base
ja_jp: データベース
zh_hans_cn: 数据库
zh_tw: 資料庫

# Database.Title
source: Data base
ja_jp: データベース
zh_hans_cn: 数据库
zh_tw: 資料庫

# WebWaitFrameAvailable.Description
source: Check if the given frame can be switched to.
ja_jp: 指定されたフレームがに切り替えられるかどうかをチェックします。
zh_hans_cn: 检查给定的框架是否可以切换到。
zh_tw: 檢查給定的框架是否可以切換到。

# WebWaitFrameAvailable.Title
source: Wait for * frame switchable
ja_jp: 待機*フレームが切り替え可能
zh_hans_cn: 等待*框架
zh_tw: 等待*框架

# WebWaitVisibilityByLocator.Description
source: By location strategy to check whether elements known to exist on the page dom are visible, visibility means that elements are not only displayed but also with height and width greater than 0
ja_jp: ページdom上に存在することがわかっているエレメントが表示されているかどうかを確認します。表示は、エレメントが表示されているだけでなく、高さと幅が0よりも大きいことを意味します
zh_hans_cn: 通过定位策略，检查已知存在于页面 DOM 上的元素是否可见，可见性意味着元素不仅被显示而且高度和宽度都大于 0
zh_tw: 通過定位策略，檢查已知存在於頁面dom上的元素是否可見，可見性意味著元素不僅被顯示而且高度和寬度都大於0

# WebWaitVisibilityByLocator.Title
source: Wait for * visible (positioner)
ja_jp: 待機*可視(ロケータ)
zh_hans_cn: 等待*可见（定位）
zh_tw: 等待*可見（定位）

# ArraySize.Description
source: Get the length of the array.
zh_hans_cn: 获取 数组 的长度。
zh_tw: 獲取數組的長度。

# ArraySize.Title
source: Array length
zh_hans_cn: 数组长度
zh_tw: 數組長度

# Network.Description
source: Network
ja_jp: ネットワーク
zh_hans_cn: 网络
zh_tw: 網絡

# Network.Title
source: Network
ja_jp: ネットワーク
zh_hans_cn: 网络
zh_tw: 網絡

# WebOpen.Description
source: Open the browser, support, and open the chrome and edge browser.
ja_jp: ブラウザを開く、サポートする、chromeとedgeブラウザを開く。
zh_hans_cn: 打开浏览器，支持，打开 Chrome 和 Edge浏览器。
zh_tw: 打開瀏覽器，支持，打開chrome和edge瀏覽器。

# WebOpen.Title
source: WebOpen
zh_hans_cn: 打开浏览器
zh_tw: 打開瀏覽器

# WebWaitTitle.Description
source: Check that the header contains a case-sensitive string.
ja_jp: タイトルに大文字と小文字を区別する文字列が含まれているかどうか
zh_hans_cn: 检查标题是否包含区分大小写的字符串。
zh_tw: 檢查標題是否包含區分大小寫的字串。

# WebWaitTitle.Title
source: Waiting for * title
ja_jp: 待機*タイトル
zh_hans_cn: 等待*标题
zh_tw: 等待*標題

# WebElementSubmit.Description
source: Form submission
ja_jp: フォーム送信
zh_hans_cn: 表单提交
zh_tw: 表單提交

# WebElementSubmit.Title
source: Form submission
ja_jp: フォーム送信
zh_hans_cn: 表单提交
zh_tw: 表單提交

# WebGetElement.Description
source: Find the web element
ja_jp: Web要素の検索
zh_hans_cn: 查找 Web 元素
zh_tw: 查找web元素

# WebGetElement.Title
source: Find elements
ja_jp: 要素の検索
zh_hans_cn: 查找元素
zh_tw: 查找元素

# HttpDownload.Description
source: This action downloads the network files through the http protocol.
ja_jp: このアクションは、httpプロトコルを介してネットワークファイルをダウンロードします。
zh_hans_cn: 此动作通过 HTTP 协议下载网络文件。
zh_tw: 此動作通過http協議下載網絡檔案。

# HttpDownload.Title
source: HttpDownload
zh_hans_cn: 文件下载
zh_tw: 文件下載

# WebElementAttribute.Description
source: Get properties
ja_jp: 属性の取得
zh_hans_cn: 获取属性
zh_tw: 獲取内容

# WebElementAttribute.Title
source: Get properties
ja_jp: 属性の取得
zh_hans_cn: 获取属性
zh_tw: 獲取内容

# WebCookies.Description
source: Get the cookies
ja_jp: Cookiesの取得
zh_hans_cn: 获取浏览器站点的 Cookies
zh_tw: 獲取瀏覽器站點的 Cookies

# WebCookies.Title
source: Get the cookies
ja_jp: Cookiesの取得
zh_hans_cn: 获取 Cookie
zh_tw: 獲取 Cookie

# WebWaitPresence.Description
source: Check that an element is present in the dom of the page does not necessarily mean that the element is visible.
ja_jp: エレメントがページのdomに存在するかどうかを確認します。これは、エレメントが表示されていることを必ずしも意味しません。
zh_hans_cn: 检查元素是否存在于页面的 DOM 中，这并不一定意味着该元素是可见的。
zh_tw: 檢查元素是否存在於頁面的dom中，這並不一定意味著該元素是可見的。

# WebWaitPresence.Title
source: Wait for the * elements to appear
ja_jp: 待ち*要素のレンダリング
zh_hans_cn: 等待*元素呈现
zh_tw: 等待*元素呈現

# ArithmeticCalculate.Description
source: Conduct the (+ - * /) arithmetic operations, and the source data must support the arithmetic operation.
ja_jp: (+-*/)算術演算を実行するには、ソース・データが算術演算をサポートしている必要があります。
zh_hans_cn: 进行(+ - * / ) 算术运算，源数据必须支持算术运行。
zh_tw: 進行(+ - * / ) 算術運算，源數據必須支持算術運行。

# ArithmeticCalculate.Title
source: Arithmetic operation
ja_jp: 算術演算
zh_hans_cn: 算术运行
zh_tw: 算術運行

# Algorithm.Description
source: Algorithm
ja_jp: アルゴリズム
zh_hans_cn: 算法
zh_tw: 算灋

# Algorithm.Title
source: Algorithm
ja_jp: アルゴリズム
zh_hans_cn: 算法
zh_tw: 算灋

# FindContours.Description
source: Find the outline
ja_jp: プロファイルの検索
zh_hans_cn: 查找轮廓
zh_tw: 查找輪廓

# FindContours.Title
source: Find the outline
ja_jp: プロファイルの検索
zh_hans_cn: 查找轮廓
zh_tw: 查找輪廓

# ImageMorphological.Description
source: Morphological manipulation is a set of operations based on shape-processing images. they apply the structured elements to the input image and generate the output image.
ja_jp: モルフォロジー操作は、シェイプに基づいて画像を処理する一連の操作である。彼らは、構造化要素を入力画像に適用し、出力画像を生成する。
zh_hans_cn: 形态学操作是一组基于形状处理图像的操作。他们将结构化元素应用于输入图像并生成输出图像。
zh_tw: 形態學操作是一組基於形狀處理影像的操作。 他們將結構化元素應用於輸入影像並生成輸出影像。

# ImageMorphological.Title
source: Morphological operation
ja_jp: けいたいがくてきそうさ
zh_hans_cn: 形态学操作
zh_tw: 形態學操作

# TextDetection.Description
source: Detection text areas on the image.
ja_jp: 画像上のテキスト領域を検出します。
zh_hans_cn: 检测图像上的文本区域。
zh_tw: 檢測影像上的文字區域。

# TextDetection.Title
source: Text block detection
ja_jp: テキストブロックの検出
zh_hans_cn: 文本块检测
zh_tw: 文字塊檢測

# UserAdd.Description
source: This action can add an account to the operating system.
zh_hans_cn: 该动作可以在操作系统中增加账户。
zh_tw: 該動作可以在作業系統中新增帳戶。

# UserAdd.Title
source: Add users
zh_hans_cn: 添加用户
zh_tw: 添加用戶

# TypeRect.Description
source: Define a rectangular type
ja_jp: 長方形の種類を定義する
zh_hans_cn: 定义一个 矩形 类型
zh_tw: 定義一個矩形類型

# TypeRect.Title
source: Rectangle
ja_jp: 長方形
zh_hans_cn: 矩形
zh_tw: 矩形

# SplitString.Description
source: Split the string
ja_jp: 分割文字列
zh_hans_cn: 分割字符串
zh_tw: 分割字串

# SplitString.Title
source: Split the string
ja_jp: 分割文字列
zh_hans_cn: 分割字符串
zh_tw: 分割字串

# TypeScalar.Description
source: Deine the scalar type, the scalar contains 4 values
ja_jp: 4つの数値で構成されるスカラーのタイプを定義します
zh_hans_cn: 定义 标量 类型，标量 包含 4 个数值
zh_tw: 定義標量類型，標量包含4個數值

# TypeScalar.Title
source: Scalar
ja_jp: スカラ
zh_hans_cn: 标量
zh_tw: 標量

# SpecialWindow.Description
source: This action is used to select a known specific window.
ja_jp: このアクションは、既知の特定のウィンドウを選択します。
zh_hans_cn: 此动作用来选择已知的特定窗口。
zh_tw: 此動作用來選擇已知的特定視窗。

# SpecialWindow.Title
source: Specific window
ja_jp: 特定のウィンドウ
zh_hans_cn: 特定窗口
zh_tw: 特定視窗

# WindowAncestor.Description
source: Retrieves the handle to the ancestor of the specified window.
zh_hans_cn: 检索指定窗口的祖先窗口
zh_tw: 檢索指定窗口的祖先窗口

# WindowAncestor.Title
source: WindowAncestor
zh_hans_cn: 祖先窗口
zh_tw: 祖先窗口

# OpenApplication.Description
source: Open the software in the windows system. this action does not wait for the program to end.
ja_jp: Windowsシステムでソフトウェアを開きます。このアクションは、プログラムが終了するまで待機しません。
zh_hans_cn: 打开Windows系统当中的软件。该动作不会等待程序结束。
zh_tw: 打開windows系統當中的軟件。 該動作不會等待程式結束。

# OpenApplication.Title
source: Open the application
ja_jp: アプリケーションを開く
zh_hans_cn: 打开应用
zh_tw: 打開應用

# NameAlias.Description
source: This action is the passing action that can be used in the name reference process.
ja_jp: この動作は、名前参照プロセスにおいて、通りすがり動作として使用されることがある。
zh_hans_cn: 此动作通过 名称 引用流程当中，可以被使用的路过动作。
zh_tw: 此動作通過名稱引用流程當中，可以被使用的路過動作。

# NameAlias.Title
source: Reference action (name)
ja_jp: 参照アクション(名前)
zh_hans_cn: 引用动作（名称）
zh_tw: 引用動作（名稱）

# LaunchFile.Description
source: This action can open the associated files in the operating system, that is, non -executable files, such as (.txt | .docx | .pptx) and other types.
zh_hans_cn: 该动作可以打开操作系统中的关联文件，即非可执行文件，比如 (.txt|.docx|.pptx) 等类型的文件。
zh_tw: 該動作可以打開操作系統中的關聯文件，即非可執行文件，比如 (.txt|.docx|.pptx) 等類型的文件。

# LaunchFile.Title
source: LaunchFile
zh_hans_cn: 打开关联文件
zh_tw: 打開關聯文件

# TextRecognition.Description
source: Text recognition
ja_jp: テキスト認識
zh_hans_cn: 文本识别
zh_tw: 文字識別

# TextRecognition.Title
source: Text recognition
ja_jp: テキスト認識
zh_hans_cn: 文本识别
zh_tw: 文字識別

# WebSwitchToFrame.Description
source: Switch the focus to the specified frame
ja_jp: 指定したフレームにフォーカスを切り替え
zh_hans_cn: 将焦点切换到指定的框架
zh_tw: 將焦點切換到指定的框架

# WebSwitchToFrame.Title
source: WebSwitchToFrame
zh_hans_cn: 切换框架
zh_tw: 切換框架

# WebActionClick.Description
source: Click on a web element, and this action needs to be added to the action chain.
ja_jp: Web要素をクリックすると、アクションがアクションチェーンに追加されます。
zh_hans_cn: 单击一个 Web 元素, 此动作需要加入到动作链当中。
zh_tw: 按一下一個web元素，此動作需要加入到動作鏈當中。

# WebActionClick.Title
source: Action chain. click
ja_jp: アクションチェーン.クリック
zh_hans_cn: 动作链.点击
zh_tw: 動作鏈.點擊

# WhenEvent.Description
source: This action will turn on an asynchronous thread to constantly detect the event status, until the state becomes: `On`, that is, when there is a signal, it will execute the sub -process.
zh_hans_cn: 该动作会开启一个异步线程不停的检测事件状态，直到状态变为：`On` ,即为有信号时，则会去执行子流程。
zh_tw: 該動作會開啟一個異步線程不停的檢測事件狀態，直到狀態變為：`On` ,即為有信號時，則會去執行子流程。

# WhenEvent.Title
source: WhenEvent
zh_hans_cn: 等待事件
zh_tw: 等待事件

# WebScreenshot.Description
source: Element screenshots or page screenshots
ja_jp: 要素のスクリーンショットまたはページのスクリーンショット
zh_hans_cn: 元素截图或者页面截图
zh_tw: 元素截圖或者頁面截圖

# WebScreenshot.Title
source: Elemental screenshots
ja_jp: 要素のスクリーンショット
zh_hans_cn: 元素截图
zh_tw: 元素截圖

# PressAndReleaseKey.Description
source: Press the keyboard button for a certain amount of time, and then release the key
ja_jp: キーボードキーを一定時間押した後、キーを放す
zh_hans_cn: 按下键盘按键一定的时间，然后释放按键
zh_tw: 按下鍵盤按鍵一定的時間，然後釋放按鍵

# PressAndReleaseKey.Title
source: Press and release
ja_jp: 押して離す
zh_hans_cn: 按下并释放
zh_tw: 按下並釋放

# MessageBox.Description
source: A message box pops up, which will prevent the process from continuing to execute until the message box is closed.
zh_hans_cn: 弹出一个消息框，该动作会阻止流程继续执行，直到消息框关闭。
zh_tw: 彈出一個消息框，該動作會阻止流程繼續執行，直到消息框關閉。

# MessageBox.Title
source: MessageBox
zh_hans_cn: 消息框
zh_tw: 消息框

# MoveOffset.Description
source: With the current position of the mouse as the starting position and move the mouse by the offset.
ja_jp: マウスの現在の位置を開始位置として、オフセットに応じてマウスを移動します。
zh_hans_cn: 以鼠标当前的位置为起始位置，按照偏移量来移动鼠标。
zh_tw: 以滑鼠當前的位置為起始位置，按照偏移量來移動滑鼠。

# MoveOffset.Title
source: MoveOffset
zh_hans_cn: 偏移移动
zh_tw: 偏移移動

# TextChinese.Description
source: Identify the chinese text in the picture.
ja_jp: 画像中の中国語の文字を認識する。
zh_hans_cn: 识别图片中的中文文字。
zh_tw: 識別圖片中的中文文字。

# TextChinese.Title
source: Chinese recognition
ja_jp: 中国語認識
zh_hans_cn: 中文识别
zh_tw: 中文識別

# ResizeImage.Description
source: Adjust the size
ja_jp: 寸法を調整する
zh_hans_cn: 调整尺寸
zh_tw: 調整尺寸
